Catalogs/бит_бу_БиллинговыеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_бу_БиллинговыеУслуги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевыеСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначениеЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвижениеЦС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДвиженияЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыНачислений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_бу_ТипыНачисленийПоЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РежимыПотребленияУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РежимПотребленияУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_бу_СведенияОБиллинговыхУслугах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_бу_СведенияОБиллинговыхУслугах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_бу_ПолучателиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_бу_ПолучателиДенежныхСредств</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолучательДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_бу_БиллинговыеУслуги/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
// Функция определеяет возможность удаления режима потребеления.
//
Функция ОпределитьВозможностьУдаленияРежимПотребления(РежимПотребления)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.бит_бу_СведенияОБиллинговыхУслугах.СрезПоследних(
	|			&Период,
	|			Услуга = &БиллинговаяУслуга
	|				И РежимПотребления = &РежимПотребления) КАК бит_бу_СведенияОБиллинговыхУслугахСрезПоследних";
	Запрос.УстановитьПараметр("Период"           , КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("БиллинговаяУслуга", Объект.Ссылка);
	Запрос.УстановитьПараметр("РежимПотребления" , РежимПотребления);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ()

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	КэшированныеЗначения.Вставить("РежимПотребленияПустаяСсылка", Справочники.бит_РежимыПотребленияУслуг.ПустаяСсылка());
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

// БИТ_ЖКХ 28.10.2011
//
&НаКлиенте
Процедура Основной(Команда)
	
	ТекущаяСтрока = Элементы.РежимыПотребленияУслуг.ТекущиеДанные;
	
	Для каждого Строка Из Объект.РежимыПотребленияУслуг Цикл
		
		Строка.Основной = Ложь;
		
	КонецЦикла; 
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Объект.ОсновнойРежимПотребления = ТекущаяСтрока.РежимПотребленияУслуг;
		ТекущаяСтрока.Основной          = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// БИТ_ЖКХ 28.10.2011
//
&НаКлиенте
Процедура РежимыПотребленияУслугПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.РежимыПотребленияУслуг.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	УдалениеРазрешено = Истина;
	
	УдалениеРазрешено = ОпределитьВозможностьУдаленияРежимПотребления(ТекущаяСтрока.РежимПотребленияУслуг);	
	
	Если НЕ УдалениеРазрешено Тогда
		Отказ = Истина;

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Существуют документы проведенные по режиму потребления <"+ТекущаяСтрока.РежимПотребленияУслуг+">!
		|Удаление не возможно.");
		
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.РежимПотребленияУслуг = Объект.ОсновнойРежимПотребления Тогда
		Объект.ОсновнойРежимПотребления = мКэшЗначений.РежимПотребленияПустаяСсылка;
	КонецЕсли;
	
КонецПроцедуры

// БИТ_ЖКХ 28.10.2011
//
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.НаименованиеПолное) тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ОкрытьРегстрСведений(Команда)
	
	СписокПоставщиков = ПолучитьСписокПоставщиков();
	
	Отбор = Новый Структура;
	Отбор.Вставить("Услуга"   , Параметры.Ключ);
	Отбор.Вставить("Поставщик", СписокПоставщиков);
	ОткрытьФорму("РегистрСведений.бит_бу_ПолучателиДенежныхСредств.Форма.ФормаСписка", Новый Структура("Отбор", Отбор));
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура РежимыПотребленияУслугПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекСтрока = Элементы.РежимыПотребленияУслуг.ТекущиеДанные;
	
	Если ТекСтрока.РежимПотребленияУслуг = ПредопределенноеЗначение("Справочник.бит_РежимыПотребленияУслуг.ПустаяСсылка") Тогда
		
		Отказ = Истина;	
		ПоказатьПредупреждение(Новый ОписаниеОповещения("РежимыПотребленияУслугПередОкончаниемРедактированияЗавершение", ЭтотОбъект), "Выберите режим потребления услуг из списка");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РежимыПотребленияУслугПередОкончаниемРедактированияЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция ПолучитьСписокПоставщиков()
	
	СписокПоставщиков = Новый СписокЗначений;
	ТЗ = Объект.Поставщики.Выгрузить();
	СписокПоставщиков.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Поставщик"));
	
	Возврат СписокПоставщиков;
	
КонецФункции

#КонецОбласти
